Revit 2026 API

# ReferencePointPosition Property

---

The position of the ReferencePoint.

**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 26.0.4.0 (26.0.4.0)

```csharp
public XYZ Position { get; set; }
```
```vb
Public Property Position As XYZ
	Get
	Set
```
```cpp
public:
property XYZ^ Position {
	XYZ^ get ();
	void set (XYZ^ value);
}
```
```fsharp
member Position : XYZ with get, set
```

#### Property Value

XYZ

| Exception | Condition |
| --- | --- |
| InvalidOperationException | Thrown when CoordinateSystem is set while the Reference property is not , and the ReferencePoint is unable to move to the new location. |

This is an alternate interface to the property CoordinateSystem.Origin. When set, the effect is the same as setting the CoordinateSystem property to the same as its current value but with a different Origin.

#### Reference

ReferencePoint Class

Autodesk.Revit.DB Namespace